fix: frontend bug, update readme with demo image
